


// Хиджабы
import hid_pub_1 from '../hidjabs/hid_pub_1.png';
import hid_pub_5 from '../hidjabs/hid_pub_5.png';
import hid_pub_2 from '../hidjabs/hid_pub_2.png';
import hid_pub_3 from '../hidjabs/hid_pub_3.png';
import hid_pub_4 from '../hidjabs/hid_pub_4.png';
import hid_pub_7 from '../hidjabs/hid_pub_7.png';
import hid_pub_8 from '../hidjabs/hid_pub_8.png';

import hidjab_pub_2_1 from '../hidjabs/hidjab_pub_2.1.png';
import hidjab_pub_2_2 from '../hidjabs/hidjab_pub_2.2.png';
import hidjab_pub_2_3 from '../hidjabs/hidjab_pub_2.3.png';
import hidjab_pub_2_4 from '../hidjabs/hidjab_pub_2.4.png';
import hidjab_pub_2_5 from '../hidjabs/hidjab_pub_2.5.png';

import hidjab_pub_3_1 from '../hidjabs/hidjab_pub_3.1.jpg';
import hidjab_pub_3_2 from '../hidjabs/hidjab_pub_3.2.jpg';
import hidjab_pub_3_3 from '../hidjabs/hidjab_pub_3.3.jpg';
import hidjab_pub_3_4 from '../hidjabs/hidjab_pub_3.4.jpg';
import hidjab_pub_3_5 from '../hidjabs/hidjab_pub_3.5.jpg';
import hidjab_pub_3_6 from '../hidjabs/hidjab_pub_3.6.jpg';

import hidjab_4_1 from '../hidjabs/hidjab_4_1.jpg';
import hidjab_4_2 from '../hidjabs/hidjab_4_2.jpg';
import hidjab_4_3 from '../hidjabs/hidjab_4_3.jpg';

import hidjab_5_1 from '../hidjabs/hidjab_5_1.jpg';
import hidjab_5_2 from '../hidjabs/hidjab_5_2.jpg';
import hidjab_5_3 from '../hidjabs/hidjab_5_3.jpg';

import hidjab_6_1 from '../hidjabs/hidjab_6_1.jpg';
import hidjab_6_2 from '../hidjabs/hidjab_6_2.jpg';
import hidjab_6_3 from '../hidjabs/hidjab_6_3.jpg';
import hidjab_6_4 from '../hidjabs/hidjab_6_4.jpg';

import hidjab_7_1 from '../hidjabs/hidjab_7_1.jpg';
import hidjab_7_2 from '../hidjabs/hidjab_7_2.jpg';

import hidjab_8_1 from '../hidjabs/hidjab_8_1.jpg';

import hidjab_9_1 from '../hidjabs/hidjab_9_1.jpg';
import hidjab_9_2 from '../hidjabs/hidjab_9_2.jpg';
import hidjab_9_3 from '../hidjabs/hidjab_9_3.jpg';

import hidjab_10_1 from '../hidjabs/hidjab_10_1.jpg';
import hidjab_10_2 from '../hidjabs/hidjab_10_2.jpg';
import hidjab_10_3 from '../hidjabs/hidjab_10_3.jpg';
import hidjab_10_4 from '../hidjabs/hidjab_10_4.jpg';

import hidjab_11_1 from '../hidjabs/hidjab_11_1.jpg';
import hidjab_11_2 from '../hidjabs/hidjab_11_2.jpg';

import hidjab_12_1 from '../hidjabs/hidjab_12_1.jpg';




// Образы
import obraz_1_1 from '../obraz/obraz_1_1.jpg';
import obraz_1_2 from '../obraz/obraz_1_2.jpg';
import obraz_1_3 from '../obraz/obraz_1_3.jpg';

import obraz_2_1 from '../obraz/obraz_2_1.jpg';
import obraz_2_2 from '../obraz/obraz_2_2.jpg';
import obraz_2_3 from '../obraz/obraz_2_3.jpg';

import obraz_3_1 from '../obraz/obraz_3_1.jpg';

import obraz_4_1 from '../obraz/obraz_4_1.jpg';

import obraz_4_2 from '../obraz/obraz_4_2.jpg';

import obraz_5_1 from '../obraz/obraz_5_1.jpg';

import obraz_6_1 from '../obraz/obraz_6_1.jpg';

import obraz_7_1 from '../obraz/obraz_7_1.jpg';
import obraz_7_2 from '../obraz/obraz_7_2.jpg';
import obraz_7_3 from '../obraz/obraz_7_3.jpg';

import obraz_8_1 from '../obraz/obraz_8_1.jpg';
import obraz_8_2 from '../obraz/obraz_8_2.jpg';
import obraz_8_3 from '../obraz/obraz_8_3.jpg';

import obraz_9_1 from '../obraz/obraz_9_1.jpg';

import obraz_10_1 from '../obraz/obraz_10_1.jpg';
import obraz_10_2 from '../obraz/obraz_10_2.jpg';
import obraz_10_3 from '../obraz/obraz_10_3.jpg';

import obraz_11_1 from '../obraz/obraz_11_1.jpg';
import obraz_11_2 from '../obraz/obraz_11_2.jpg';
import obraz_11_3 from '../obraz/obraz_11_3.jpg';
import obraz_11_4 from '../obraz/obraz_11_4.jpg';

import obraz_12_1 from '../obraz/obraz_12_1.jpg';
import obraz_12_2 from '../obraz/obraz_12_2.jpg';

import obraz_13_1 from '../obraz/obraz_13_1.jpg';
import obraz_13_2 from '../obraz/obraz_13_2.jpg';
import obraz_13_3 from '../obraz/obraz_13_3.jpg';

import obraz_14_1 from '../obraz/obraz_13_1.jpg';

import obraz_15_1 from '../obraz/obraz_15_1.jpg';
import obraz_15_2 from '../obraz/obraz_15_2.jpg';




// Брюки и юпки
import yupky_1_1 from '../yupky/yupky_1_1.jpg';

import yupky_2_1 from '../yupky/yupky_2_1.jpg';
import yupky_2_2 from '../yupky/yupky_2_2.jpg';
import yupky_2_3 from '../yupky/yupky_2_3.jpg';

import yupky_3_1 from '../yupky/yupky_3_1.jpg';
import yupky_3_2 from '../yupky/yupky_3_2.jpg';

import yupky_4_1 from '../yupky/yupky_4_1.jpg';

import yupky_5_1 from '../yupky/yupky_5_1.jpg';
import yupky_5_2 from '../yupky/yupky_5_2.jpg';

import yupky_6_1 from '../yupky/yupky_6_1.jpg';

import yupky_7_1 from '../yupky/yupky_7_1.jpg';

import yupky_8_1 from '../yupky/yupky_8_1.jpg';
import yupky_8_2 from '../yupky/yupky_8_2.jpg';

import yupky_9_1 from '../yupky/yupky_9_1.jpg';
import yupky_9_2 from '../yupky/yupky_9_2.jpg';
import yupky_9_3 from '../yupky/yupky_9_3.jpg';




// Футболки и рубашки

import futbolka_1_1 from '../futbolka/futbolka_1_1.jpg';
import futbolka_1_2 from '../futbolka/futbolka_1_2.jpg';
import futbolka_1_3 from '../futbolka/futbolka_1_3.jpg';

import futbolka_2_1 from '../futbolka/futbolka_2_1.jpg';

import futbolka_3_1 from '../futbolka/futbolka_3_1.jpg';

import futbolka_4_1 from '../futbolka/futbolka_4_1.jpg';

import futbolka_5_1 from '../futbolka/futbolka_5_1.jpg';

import futbolka_6_1 from '../futbolka/futbolka_6_1.jpg';
import futbolka_6_2 from '../futbolka/futbolka_6_2.jpg';

import futbolka_7_1 from '../futbolka/futbolka_7_1.jpg';

import futbolka_8_1 from '../futbolka/futbolka_8_1.jpg';









const productsData = [
  {
    id: 71,
    title: 'Брюки домашние',
    price: 1500,
    category: 'Брюки и юбки',
    images: [yupky_2_1, yupky_2_2, yupky_2_3],
    description: 'Удобные домашние брюки из мягкой ткани для комфорта каждый день.',
  },
  {
    id: 70,
    title: 'Юбки рыбки по косой',
    price: 1500,
    category: 'Брюки и юбки',
    images: [yupky_1_1],
    description: 'Элегантная юбка-рыбка по косой, подчёркивает фигуру и добавляет женственности.',
  },
  {
    id: 72,
    title: 'Юбка летняя',
    price: 1650,
    category: 'Брюки и юбки',
    images: [yupky_3_1, yupky_3_2],
    description: 'На лето самое то! В этой юбке вообще не жарко😍',
  },
  {
    id: 73,
    category: 'Брюки и юбки',
    title: 'Брюки универсальные',
    price: 1500,
    images: [yupky_4_1],
    description: 'Универсальные классические брюки, которые подойдут для любого случая. Сшиты из высококачественного материала, они комфортно сидят по фигуре и обеспечивают элегантный и стильный вид. Отличный выбор для работы или вечерних выходов.',
  },
  {
    id: 74,
    category: 'Брюки и юбки',
    price: 2200,
    title:'Штаны мягкие',
    images: [yupky_5_1, yupky_5_2],
    description: 'Получили супер удобные, мягкие штанишки, которые подойдут для повседневного использования. Они приятные на ощупь, легко сочетаются с разной одеждой, обеспечивая комфорт на протяжении всего дня.',
  },
  {
    id: 76,
    category: 'Брюки и юбки',
    title: 'Короткая юбка',
    price: 2400,
    images: [yupky_7_1],
    description: 'Стильная короткая юбка для тёплых дней. Отлично сочетается с футболками, блузками и жакетами, создавая модный и уверенный образ.',
  },
  {
    id: 77,
    category: 'Брюки и юбки',
    title: 'Атласная юбка 🥰',
    price: 2900,
    images: [yupky_8_1, yupky_8_2],
    description: 'Элегантная атласная юбка, добавляющая образу утончённости и шика. Легко комбинируется с разными топами и обувью — идеальный вариант для особых случаев и стильных будней.',
  },
  {
    id: 78,
    category: 'Брюки и юбки',
    title: 'Стильные брюки',
    price: 1200,
    images: [yupky_9_1, yupky_9_2, yupky_9_3],
    description: 'Стиль и комфорт в одном образе ❤️ Эти брюки легко впишутся в повседневный гардероб, сочетаясь с любыми топами и обувью. Идеальны для активного дня и уверенного образа.',
  },









  {
    id: 79,
    category: 'Рубашки и футболки',
    title: 'Разноцветные обтягивающие футболки',
    price: 1300,
    images: [futbolka_1_1, futbolka_1_2, futbolka_1_3],
    description: 'Обтягивающие разноцветные футболки, идеально подходящие для активных дней. Эластичный материал подчёркивает фигуру и обеспечивает комфорт в движении. Отличный выбор для спорта и повседневных образов.',
  },
  {
    id: 80,
    category: 'Рубашки и футболки',
    title: 'Футболки варёнки',
    price: 1700,
    images: [futbolka_2_1],
    description: 'Футболки варёнки нереального качества ☺️ Удобные, стильные и приятные к телу. Отлично подойдут для создания повседневного или спортивного образа.',
  },
  {
    id: 81,
    category: 'Рубашки и футболки',
    title: 'Джинсовые рубашки',
    price: 1800,
    images: [futbolka_3_1],
    description: 'Джинсовые рубашки в самых трендовых цветах 🥺 Стильный и универсальный элемент гардероба, который легко комбинируется с юбками, брюками и шортами. Подходят для любого сезона.',
  },
  {
    id: 82,
    category: 'Рубашки и футболки',
    title: 'Батники из тонкой вафли',
    price: 1300,
    images: [futbolka_4_1],
    description: 'Лёгкие батники из тонкой вафельной ткани — идеальны для весенне-летнего сезона. Удобные, дышащие и мягкие на ощупь. Подходят как для повседневной носки, так и для расслабленного домашнего стиля.',
  },
  {
    id: 83,
    category: 'Рубашки и футболки',
    title: 'Свободная рубашка',
    price: 1990,
    images: [futbolka_5_1],
    description: 'Свободная рубашка — универсальный вариант для любого гардероба. Подходит для создания расслабленных и стильных образов. Комфортный крой и лёгкий материал делают её идеальной для тёплого сезона.',
  },
  {
    id: 84,
    category: 'Рубашки и футболки',
    title: 'Рубашки из муслина',
    price: 1800,
    images: [futbolka_6_1, futbolka_6_2],
    description: 'Лёгкие и воздушные рубашки из муслина — идеальны для жаркого времени года. Приятный на ощупь материал дарит комфорт и стиль в любом образе.',
  },
  {
    id: 85,
    category: 'Рубашки и футболки',
    title: 'Рубашка в клетку',
    price: 1700,
    images: [futbolka_7_1],
    description: 'Классическая рубашка в клетку — стильный и универсальный элемент гардероба. Подходит для создания как повседневных, так и более формальных образов.',
  },
  {
    id: 86,
    category: 'Рубашки и футболки',
    title: 'Поло со сборками',
    price: 1300,
    images: [futbolka_8_1],
    description: 'Поло со сборками — стильная и удобная альтернатива классической футболке. Мягкая ткань и интересный крой делают её идеальной для casual-образов.',
  },
  
  
  
  
  
  











  {
    id: 50,
    title: 'Льняная двойка',
    images: [obraz_1_3, obraz_1_2, obraz_1_1],
    description: 'В трёх базовых оттенках наша новая двойка изо льна 🥰',
    price: 3200,
    category: 'Образы',
  },
  {
    id: 52,
    title: 'Нарядная двойка',
    images: [obraz_3_1],
    description: 'Нарядная двойка — элегантный выбор для особых случаев и стильных выходов.',
    price: 3800,
    category: 'Образы',
  },
  
  {
    id: 51,
    title: 'Айвори / Белый',
    images: [obraz_2_1, obraz_2_2, obraz_2_3],
    description: 'Самое время порадовать себя модной новинкой🍭, которая потрясающе преобразит вас❣️',
    price: 3300,
    category: 'Образы',
  },
  {
    id: 56,
    title: 'Нарядная двойка',
    images: [obraz_6_1],
    description: 'Элегантная двойка, идеально подходящая для особых мероприятий и стильных выходов. Лёгкий материал и утончённый крой.',
    price: 3200,
    category: 'Образы',
  },
  {
    id: 53,
    title: 'Брюка с рубашкой',
    images: [obraz_4_1],
    description: 'Брюка с рубашкой — лёгкий и стильный образ на каждый день.',
    price: 2300,
    category: 'Образы',
  },
  {
    id: 54,
    title: 'Двойка',
    images: [obraz_4_2],
    description: 'Элегантная двойка, которая добавит стильности в ваш образ.',
    price: 3100,
    category: 'Образы',
  },
  {
    id: 55,
    title: 'Сарафан',
    images: [obraz_5_1],
    description: 'Лёгкий и стильный сарафан для тёплого сезона. Отлично подойдёт как для прогулок, так и для особых случаев.',
    price: 3700,
    category: 'Образы',
  },
  {
    id: 58,
    title: 'Тройка из хлопковой ткани',
    images: [obraz_8_1, obraz_8_2, obraz_8_3],
    description: 'Мягкая и лёгкая тройка из натурального хлопка. Комфортный фасон, дышащий материал и универсальный стиль на каждый день.',
    price: 3300,
    category: 'Образы',
  },
  
  {
    id: 57,
    title: 'Платье (Производство: Турция 🇹🇷)',
    images: [obraz_7_1, obraz_7_2, obraz_7_3],
    description: 'Стильное платье турецкого производства. Качественный пошив, современный дизайн и лёгкий материал делают его идеальным для любого случая.',
    price: 3300,
    category: 'Образы',
  },
  {
    id: 59,
    title: 'Платье в трёх расцветках',
    images: [obraz_9_1],
    description: 'Элегантное платье в базовых расцветках: чёрный, коричневый и серый. Комфортный крой и универсальный стиль для любого повода.',
    price: 2600,
    category: 'Образы',
  },

  {
    id: 60,
    title: 'Двоечка ✨💔',
    images: [obraz_10_1, obraz_10_2, obraz_10_3],
    description: 'Стильная и универсальная двоечка — лёгкий образ для любого случая. Комфорт и изящество в каждой детали.',
    price: 2900,
    category: 'Образы',
  },
  {
    id: 61,
    title: 'Качество LUX🔥',
    images: [obraz_11_1, obraz_11_2, obraz_11_3, obraz_11_4],
    description: 'Роскошный комплект премиум-качества. Идеален для особых случаев и повседневной элегантности. Ткань высокого класса, посадка безупречная.',
    price: 3600,
    category: 'Образы',
  },
  {
    id: 62,
    title: 'Двоечки',
    images: [obraz_13_1, obraz_13_2, obraz_13_3],
    description: 'Опять же универсальное, в нём хоть куда и вживую ещё прекраснее, чем на фото. 🙈 Идеально садится, подчёркивает стиль и элегантность.',
    price: 2900,
    category: 'Образы',
  },
  {
    id: 63,
    title: 'Летняя юбка',
    images: [obraz_12_1, obraz_12_2],
    description: 'На лето самое то! В этой юбке вообще не жарко 😍 Лёгкая, дышащая ткань и комфортная посадка.',
    price: 1650,
    category: 'Образы',
  },
  {
    id: 64,
    title: 'Яркая новинка',
    images: [obraz_14_1],
    description: 'Вот такая яркая новиночка у нас сегодня 💛💛💛',
    price: 2100,
    category: 'Образы',
  },
  {
    id: 65,
    title: 'Идеальное платье на весну',
    images: [obraz_15_1, obraz_15_2],
    description: 'Идеальное платье на весну 😍🌸',
    price: 2500,
    category: 'Образы',
  },
  
  
  
  
  
  
  
  






 

  // Хиджабы
  {
    id: 20,
    title: 'Королевская химар 🕊',
    images: [
      hid_pub_1,
      hid_pub_2,
      hid_pub_3,
      hid_pub_4,
      hid_pub_5,
      hid_pub_7,
      hid_pub_8,
    ],
    description: 'Элегантный и утончённый химар, подчёркивающий благородство и скромность. Лёгкая ткань, роскошный вид.',
    price: 1900,
    category: 'Хиджабы',
  },
  {
    id: 21,
    title: 'Платье "Летний бриз" 🕊',
    images: [
      hidjab_pub_3_1,
      hidjab_pub_3_2,
      hidjab_pub_3_3,
      hidjab_pub_3_4,
      hidjab_pub_3_5,
      hidjab_pub_3_6,
    ],
    description: 'Легкое и воздушное платье с "летучими" рукавами. Идеальный выбор для жаркой погоды, подчеркивающее женственность и стиль. 🌸',
    price: 2300,
    category: 'Хиджабы',
  },
  {
  id: 22,
  title: 'Платья летучка 🕊',
  images: [
    hidjab_pub_2_1,
    hidjab_pub_2_2,
    hidjab_pub_2_3,
    hidjab_pub_2_4,
    hidjab_pub_2_5,
  ],
  description: 'Платья свободного кроя с "летучими" рукавами. Воздушные, легкие и женственные. Идеальный вариант для тёплой погоды. ☁️',
  price: 2100,
  category: 'Хиджабы',
},
{
  id: 24,
  title: 'Тыкань Калифорния',
  images: [hidjab_5_1, hidjab_5_2, hidjab_5_3],
  description: 'Тыкань "Калифорния" — утончённый стиль в каждой детали. Приятная к телу ткань, изысканный фасон и воздушная лёгкость. Подчёркивает индивидуальность и скромность.',
  price: 2850,
  category: 'Хиджабы',
},
{
  id: 23,
  title: 'Двойка с накидкой',
  images: [hidjab_4_1, hidjab_4_2, hidjab_4_3],
  description: 'Элегантная двойка с лёгкой накидкой. Подходит для особых случаев и повседневной носки. Лёгкий и дышащий материал.',
  price: 2050,
  category: 'Хиджабы',
},
{
  id: 25,
  title: 'Льняной хиджаб',
  images: [hidjab_6_1, hidjab_6_2, hidjab_6_3, hidjab_6_4],
  description: 'Хиджаб из натурального льна — лёгкий, дышащий и невероятно комфортный в носке. Идеален для повседневного образа в тёплую погоду.',
  price: 2100,
  category: 'Хиджабы',
},
{
  id: 26,
  title: 'Абайка + сарафан (лён)',
  images: [hidjab_7_1, hidjab_7_2],
  description: 'Комплект из абайки и сарафана, выполненный из натурального льна. Дышащий материал и свободный крой обеспечивают комфорт и элегантность. Идеально для тёплого сезона.',
  price: 2300,
  category: 'Хиджабы',
},
{
  id: 27,
  title: 'Двойка с юбкой (ткань париж)',
  images: [hidjab_8_1],
  description: 'Элегантная двойка с юбкой из костюмной ткани "париж". Лёгкая, удобная и универсальная модель для повседневной носки и особых случаев.',
  price: 2500,
  category: 'Хиджабы',
},
{
  id: 28,
  title: 'Намазник с балаклавой',
  images: [hidjab_9_1, hidjab_9_2, hidjab_9_3],
  description: 'Намазник из бамбуковой ткани с пришитой балаклавой — мягкий, дышащий и удобный. Идеально подходит для молитвы и повседневного ношения.',
  price: 1650,
  category: 'Хиджабы',
},
{
  id: 29,
  title: 'Двойка Супрем',
  images: [hidjab_10_1, hidjab_10_2, hidjab_10_3, hidjab_10_4], // Здесь добавлены изображения, которые ты указал
  description: 'Стильная и удобная двойка из ткани супрем. Идеальный выбор для повседневного использования, комфортная и стильная на каждый день.',
  price: 2300,
  category: 'Хиджабы',
},
{
  id: 30,
  title: 'Двойка юбочная (двунитка)',
  images: [hidjab_11_1, hidjab_11_2], // заменишь на реальные изображения
  description: 'Двойка юбочная из ткани двунитка. Мягкий материал, универсальный фасон, подходит для повседневной носки и особых случаев. Доступна в разных цветах.',
  price: 2700,
  category: 'Хиджабы',
},
{
  id: 31,
  title: 'Хиджаб с изюминкой 🌿',
  images: [hidjab_12_1],
  description: 'Хиджаб из ткани варёнка джинс — стильный, комфортный и практичный вариант для повседневного ношения. Отлично держит форму и подчёркивает образ.',
  price: 2400,
  category: 'Хиджабы',
},

];

export default productsData;

